Revit 2027 API
SolidCurveIntersectionOptions Constructor
 Constructs a new SolidCurveIntersectionMode with default settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SolidCurveIntersectionOptions()
Public Sub New
public:
SolidCurveIntersectionOptions()
new : unit -> SolidCurveIntersectionOptions
See Also
Reference
SolidCurveIntersectionOptions Class
Autodesk.Revit.DB Namespace